; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-6-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p1-0 - location
	p1-2 - location
	p1-4 - location
	p2-1 - location
	p2-3 - location
	p2-4 - location
	p3-0 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s0)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at truck6 s2)
	(empty truck6)
	(at package1 s4)
	(at package2 s1)
	(at package3 s0)
	(at package4 s0)
	(at package5 s0)
	(at package6 s0)
	(at package7 s4)
	(at package8 s0)
	(at package9 s3)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 40)
	(= (time-to-walk p1-0 s1) 40)
	(= (time-to-walk s0 p1-0) 93)
	(= (time-to-walk p1-0 s0) 93)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 59)
	(= (time-to-walk p1-2 s1) 59)
	(= (time-to-walk s2 p1-2) 77)
	(= (time-to-walk p1-2 s2) 77)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 84)
	(= (time-to-walk p1-4 s1) 84)
	(= (time-to-walk s4 p1-4) 99)
	(= (time-to-walk p1-4 s4) 99)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 67)
	(= (time-to-walk p2-3 s2) 67)
	(= (time-to-walk s3 p2-3) 11)
	(= (time-to-walk p2-3 s3) 11)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 90)
	(= (time-to-walk p2-4 s2) 90)
	(= (time-to-walk s4 p2-4) 24)
	(= (time-to-walk p2-4 s4) 24)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 13)
	(= (time-to-walk p3-0 s3) 13)
	(= (time-to-walk s0 p3-0) 33)
	(= (time-to-walk p3-0 s0) 33)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 74)
	(= (time-to-drive s1 s0) 74)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 24)
	(= (time-to-drive s2 s0) 24)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 82)
	(= (time-to-drive s4 s0) 82)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 60)
	(= (time-to-drive s4 s1) 60)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 39)
	(= (time-to-drive s1 s2) 39)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 48)
	(= (time-to-drive s3 s2) 48)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 11)
	(= (time-to-drive s4 s2) 11)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 47)
	(= (time-to-drive s1 s3) 47)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s3)
	(at truck1 s3)
	(at truck2 s0)
	(at truck4 s2)
	(at truck5 s4)
	(at truck6 s0)
	(at package1 s2)
	(at package2 s4)
	(at package3 s2)
	(at package4 s2)
	(at package5 s3)
	(at package6 s3)
	(at package8 s3)
	(at package9 s2)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 4  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver3 truck1 s0)
   deleted: (at driver3 s0) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 2 of 14
2. (walk driver1 s2 p2-3)
   deleted: (at driver1 s2)
   added: (at driver1 p2-3)
   changed: (walked) from 0 to 67
   goals met: 2 of 14
3. (load-truck package4 truck1 s0)
   deleted: (at package4 s0)
   added: (in package4 truck1)
   goals met: 2 of 14
4. (drive-truck truck1 s0 s1 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (driven) from 0 to 74
   goals met: 2 of 14
5. (walk driver1 p2-3 s3)
   deleted: (at driver1 p2-3)
   added: (at driver1 s3)
   changed: (walked) from 67 to 78
   goals met: 3 of 14
6. (drive-truck truck1 s1 s3 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (driven) from 74 to 121
   goals met: 4 of 14
7. (board-truck driver2 truck6 s2)
   deleted: (at driver2 s2) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 4 of 14
8. (load-truck package9 truck1 s3)
   deleted: (at package9 s3)
   added: (in package9 truck1)
   goals met: 4 of 14
9. (drive-truck truck6 s2 s4 driver2)
   deleted: (at truck6 s2)
   added: (at truck6 s4)
   changed: (driven) from 121 to 132
   goals met: 4 of 14
10. (load-truck package1 truck6 s4)
   deleted: (at package1 s4)
   added: (in package1 truck6)
   goals met: 4 of 14
11. (drive-truck truck6 s4 s0 driver2)
   deleted: (at truck6 s4)
   added: (at truck6 s0)
   changed: (driven) from 132 to 214
   goals met: 5 of 14
12. (load-truck package8 truck6 s0)
   deleted: (at package8 s0)
   added: (in package8 truck6)
   goals met: 5 of 14
13. (load-truck package3 truck6 s0)
   deleted: (at package3 s0)
   added: (in package3 truck6)
   goals met: 5 of 14
14. (load-truck package5 truck6 s0)
   deleted: (at package5 s0)
   added: (in package5 truck6)
   goals met: 5 of 14
15. (load-truck package6 truck6 s0)
   deleted: (at package6 s0)
   added: (in package6 truck6)
   goals met: 5 of 14
16. (drive-truck truck1 s3 s2 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (driven) from 214 to 262
   goals met: 4 of 14
17. (unload-truck package9 truck1 s2)
   deleted: (in package9 truck1)
   added: (at package9 s2)
   goals met: 5 of 14
18. (board-truck driver1 truck5 s3)
   deleted: (at driver1 s3) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 4 of 14
19. (drive-truck truck6 s0 s2 driver2)
   deleted: (at truck6 s0)
   added: (at truck6 s2)
   changed: (driven) from 262 to 286
   goals met: 3 of 14
20. (drive-truck truck5 s3 s1 driver1)
   deleted: (at truck5 s3)
   added: (at truck5 s1)
   changed: (driven) from 286 to 333
   goals met: 3 of 14
21. (unload-truck package4 truck1 s2)
   deleted: (in package4 truck1)
   added: (at package4 s2)
   goals met: 4 of 14
22. (drive-truck truck1 s2 s3 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (driven) from 333 to 381
   goals met: 5 of 14
23. (unload-truck package1 truck6 s2)
   deleted: (in package1 truck6)
   added: (at package1 s2)
   goals met: 6 of 14
24. (unload-truck package3 truck6 s2)
   deleted: (in package3 truck6)
   added: (at package3 s2)
   goals met: 7 of 14
25. (load-truck package2 truck5 s1)
   deleted: (at package2 s1)
   added: (in package2 truck5)
   goals met: 7 of 14
26. (drive-truck truck6 s2 s3 driver2)
   deleted: (at truck6 s2)
   added: (at truck6 s3)
   changed: (driven) from 381 to 429
   goals met: 7 of 14
27. (unload-truck package5 truck6 s3)
   deleted: (in package5 truck6)
   added: (at package5 s3)
   goals met: 8 of 14
28. (unload-truck package6 truck6 s3)
   deleted: (in package6 truck6)
   added: (at package6 s3)
   goals met: 9 of 14
29. (unload-truck package8 truck6 s3)
   deleted: (in package8 truck6)
   added: (at package8 s3)
   goals met: 10 of 14
30. (drive-truck truck5 s1 s4 driver1)
   deleted: (at truck5 s1)
   added: (at truck5 s4)
   changed: (driven) from 429 to 489
   goals met: 11 of 14
31. (unload-truck package2 truck5 s4)
   deleted: (in package2 truck5)
   added: (at package2 s4)
   goals met: 12 of 14
32. (drive-truck truck6 s3 s2 driver2)
   deleted: (at truck6 s3)
   added: (at truck6 s2)
   changed: (driven) from 489 to 537
   goals met: 12 of 14
33. (drive-truck truck6 s2 s0 driver2)
   deleted: (at truck6 s2)
   added: (at truck6 s0)
   changed: (driven) from 537 to 561
   goals met: 13 of 14
34. (disembark-truck driver1 truck5 s4)
   deleted: (driving driver1 truck5)
   added: (at driver1 s4) (empty truck5)
   goals met: 13 of 14
35. (disembark-truck driver2 truck6 s0)
   deleted: (driving driver2 truck6)
   added: (at driver2 s0) (empty truck6)
   goals met: 13 of 14
36. (walk driver1 s4 p2-4)
   deleted: (at driver1 s4)
   added: (at driver1 p2-4)
   changed: (walked) from 78 to 102
   goals met: 13 of 14
37. (walk driver1 p2-4 s2)
   deleted: (at driver1 p2-4)
   added: (at driver1 s2)
   changed: (walked) from 102 to 192
   goals met: 13 of 14
38. (walk driver1 s2 p2-3)
   deleted: (at driver1 s2)
   added: (at driver1 p2-3)
   changed: (walked) from 192 to 259
   goals met: 13 of 14
39. (walk driver1 p2-3 s3)
   deleted: (at driver1 p2-3)
   added: (at driver1 s3)
   changed: (walked) from 259 to 270
   goals met: 14 of 14
